perf/node_heavy_proxy_v1.txt

> perf@1.0.0 artillery
> artillery

Phase started: eigth (index: 0, duration: 1s) 13:50:13(-0500)

Phase completed: eigth (index: 0, duration: 1s) 13:50:14(-0500)

Phase started: pause (index: 1, duration: 9s) 13:50:14(-0500)

Phase completed: pause (index: 1, duration: 9s) 13:50:23(-0500)

Phase started: ninth (index: 2, duration: 1s) 13:50:23(-0500)

Phase completed: ninth (index: 2, duration: 1s) 13:50:24(-0500)

Phase started: pause (index: 3, duration: 9s) 13:50:24(-0500)

--------------------------------------
Metrics for period to: 13:50:20(-0500) (width: 5.257s)
--------------------------------------

http.codes.200: ................................................................ 1
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 1
http.response_time:
  min: ......................................................................... 5043
  max: ......................................................................... 5043
  median: ...................................................................... 5065.6
  p95: ......................................................................... 5065.6
  p99: ......................................................................... 5065.6
http.responses: ................................................................ 1
vusers.completed: .............................................................. 1
vusers.created: ................................................................ 1
vusers.created_by_name.Root (/): ............................................... 1
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5257.4
  max: ......................................................................... 5257.4
  median: ...................................................................... 5272.4
  p95: ......................................................................... 5272.4
  p99: ......................................................................... 5272.4


Phase completed: pause (index: 3, duration: 9s) 13:50:33(-0500)

Phase started: second (index: 4, duration: 5s) 13:50:33(-0500)

Phase completed: second (index: 4, duration: 5s) 13:50:38(-0500)

Phase started: pause (index: 5, duration: 10s) 13:50:38(-0500)

--------------------------------------
Metrics for period to: 13:50:30(-0500) (width: 5.011s)
--------------------------------------

http.codes.200: ................................................................ 1
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 5
http.response_time:
  min: ......................................................................... 4999
  max: ......................................................................... 4999
  median: ...................................................................... 4965.3
  p95: ......................................................................... 4965.3
  p99: ......................................................................... 4965.3
http.responses: ................................................................ 1
vusers.completed: .............................................................. 1
vusers.created: ................................................................ 5
vusers.created_by_name.Root (/): ............................................... 5
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5011.5
  max: ......................................................................... 5011.5
  median: ...................................................................... 4965.3
  p95: ......................................................................... 4965.3
  p99: ......................................................................... 4965.3


Phase completed: pause (index: 5, duration: 10s) 13:50:48(-0500)

--------------------------------------
Metrics for period to: 13:50:40(-0500) (width: 4.831s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 3
http.codes.200: ................................................................ 1
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 5
http.response_time:
  min: ......................................................................... 9787
  max: ......................................................................... 9787
  median: ...................................................................... 9801.2
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9801.2
http.responses: ................................................................ 1
vusers.completed: .............................................................. 1
vusers.created: ................................................................ 5
vusers.created_by_name.Root (/): ............................................... 5
vusers.failed: ................................................................. 3
vusers.session_length:
  min: ......................................................................... 9804.9
  max: ......................................................................... 9804.9
  median: ...................................................................... 9801.2
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9801.2


--------------------------------------
Metrics for period to: 13:50:50(-0500) (width: 4.037s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 5
vusers.failed: ................................................................. 5


All VUs finished. Total time: 37 seconds

--------------------------------
Summary report @ 13:50:49(-0500)
--------------------------------

errors.ETIMEDOUT: .............................................................. 8
http.codes.200: ................................................................ 3
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 11
http.response_time:
  min: ......................................................................... 4999
  max: ......................................................................... 9787
  median: ...................................................................... 5065.6
  p95: ......................................................................... 5065.6
  p99: ......................................................................... 5065.6
http.responses: ................................................................ 3
vusers.completed: .............................................................. 3
vusers.created: ................................................................ 11
vusers.created_by_name.Root (/): ............................................... 11
vusers.failed: ................................................................. 8
vusers.session_length:
  min: ......................................................................... 5011.5
  max: ......................................................................... 9804.9
  median: ...................................................................... 5272.4
  p95: ......................................................................... 5272.4
  p99: ......................................................................... 5272.4